app/Controllers/Artikel.php

    public function index()
    {
        $model = new ArtikelModel();
        $artikel = $model->findAll();
---
SELECT *
FROM `artikel`

    public function edit($id)
    {
        $artikelModel = new ArtikelModel();

        // Ambil data artikel berdasarkan ID
        $artikel = $artikelModel->find($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '1'